apache/nuttx/arch/arm/src/nrf91/nrf91_spi.c
/****************************************************************************
 * arch/arm/src/nrf91/nrf91_spi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>
#include <inttypes.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/mutex.h>
#include <arch/barriers.h>
#include <arch/board/board.h>
#include <nuttx/power/pm.h>

#include "arm_internal.h"

#include "nrf91_gpio.h"
#include "nrf91_spi.h"

#include "hardware/nrf91_spi.h"
#include "hardware/nrf91_utils.h"

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct nrf91_spidev_s
{
  struct spi_dev_s spidev;     /* Externally visible part of the SPI interface */
  uint32_t         base;       /* Base address of SPI register */
#ifdef CONFIG_NRF91_SPI_MASTER_INTERRUPTS
  uint32_t         irq;        /* SPI IRQ number */
#endif
  nrf91_pinset_t   sck_pin;    /* SCK pin configuration */
  uint32_t         frequency;  /* Requested clock frequency */
  uint8_t          mode;       /* Mode 0,1,2,3 */

  mutex_t          lock;       /* Held while chip is selected for mutual
                                * exclusion
                                */
#ifdef CONFIG_NRF91_SPI_MASTER_INTERRUPTS
  sem_t            sem_isr;    /* Interrupt wait semaphore */
#endif
  bool             initialized;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static inline void nrf91_spi_putreg(struct nrf91_spidev_s *priv,
                                    uint32_t offset,
                                    uint32_t value);
static inline uint32_t nrf91_spi_getreg(struct nrf91_spidev_s *priv,
                                        uint32_t offset);

/* SPI methods */

static int nrf91_spi_lock(struct spi_dev_s *dev, bool lock);
static uint32_t nrf91_spi_setfrequency(struct spi_dev_s *dev,
                                       uint32_t frequency);
static void nrf91_spi_setmode(struct spi_dev_s *priv,
                              enum spi_mode_e mode);
static void nrf91_spi_setbits(struct spi_dev_s *priv, int nbits);
#ifdef CONFIG_SPI_HWFEATURES
static int nrf91_spi_hwfeatures(struct spi_dev_s *dev,
                                spi_hwfeatures_t features);
#endif
static uint32_t nrf91_spi_send(struct spi_dev_s *dev, uint32_t wd);
static void nrf91_spi_exchange(struct spi_dev_s *dev,
                               const void *txbuffer,
                               void *rxbuffer, size_t nwords);
#ifndef CONFIG_SPI_EXCHANGE
static void nrf91_spi_sndblock(struct spi_dev_s *dev,
                               const void *txbuffer,
                               size_t nwords);
static void nrf91_spi_recvblock(struct spi_dev_s *dev,
                                void *rxbuffer,
                                size_t nwords);
#endif

#ifdef CONFIG_NRF91_SPI_MASTER_INTERRUPTS
static int nrf91_spi_isr(int irq, void *context, void *arg);
#endif

/* Initialization */

static int nrf91_spi_init(struct nrf91_spidev_s *priv);
static void nrf91_spi_pselinit(struct nrf91_spidev_s *priv,
                               uint32_t offset, nrf91_pinset_t pinset);
static void nrf91_spi_gpioinit(struct nrf91_spidev_s *priv);

#ifdef CONFIG_PM
static int nrf91_spi_deinit(struct nrf91_spidev_s *priv);
static void nrf91_spi_gpiodeinit(struct nrf91_spidev_s *priv);

static int nrf91_spi_pm_prepare(struct pm_callback_s *cb, int domain,
                                enum pm_state_e pmstate);
static void nrf91_spi_pm_notify(struct pm_callback_s *cb, int domain,
                                enum pm_state_e pmstate);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_PM
struct pm_callback_s g_pm_callbacks =
{
  .prepare = nrf91_spi_pm_prepare,
  .notify  = nrf91_spi_pm_notify
};
#endif

/* SPI0 */

#ifdef CONFIG_NRF91_SPI0_MASTER
static const struct spi_ops_s g_spi0ops =
{
  .lock              = nrf91_spi_lock,
  .select            = nrf91_spi0select,
  .setfrequency      = nrf91_spi_setfrequency,
  .setmode           = nrf91_spi_setmode,
  .setbits           = nrf91_spi_setbits,
#  ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = nrf91_spi_hwfeatures,
#  endif
  .status            = nrf91_spi0status,
#  ifdef CONFIG_SPI_CMDDATA
  .cmddata           = nrf91_spi0cmddata,
#  endif
  .send              = nrf91_spi_send,
#  ifdef CONFIG_SPI_EXCHANGE
  .exchange          = nrf91_spi_exchange,
#  else
  .sndblock          = nrf91_spi_sndblock,
  .recvblock         = nrf91_spi_recvblock,
#  endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger           = nrf91_spi_trigger,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = nrf91_spi0register,  /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct nrf91_spidev_s g_spi0dev =
{
  .spidev    =
  {
    .ops     = &g_spi0ops,
  },

  .base      = NRF91_SPIM0_BASE,
  .lock      = NXMUTEX_INITIALIZER,
#ifdef CONFIG_NRF91_SPI_MASTER_INTERRUPTS
  .sem_isr   = SEM_INITIALIZER(0),
  .irq       = NRF91_IRQ_SERIAL0,
#endif
  .sck_pin   = BOARD_SPI0_SCK_PIN,
  .frequency = 0,
  .mode      = 0
};
#endif

