apache/nuttx/arch/arm/src/nrf91/nrf91_spi.c
/* SPI1 */

#ifdef CONFIG_NRF91_SPI1_MASTER
static const struct spi_ops_s g_spi1ops =
{
  .lock              = nrf91_spi_lock,
  .select            = nrf91_spi1select,
  .setfrequency      = nrf91_spi_setfrequency,
  .setmode           = nrf91_spi_setmode,
  .setbits           = nrf91_spi_setbits,
#  ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = nrf91_spi_hwfeatures,
#  endif
  .status            = nrf91_spi1status,
#  ifdef CONFIG_SPI_CMDDATA
  .cmddata           = nrf91_spi1cmddata,
#  endif
  .send              = nrf91_spi_send,
#  ifdef CONFIG_SPI_EXCHANGE
  .exchange          = nrf91_spi_exchange,
#  else
  .sndblock          = nrf91_spi_sndblock,
  .recvblock         = nrf91_spi_recvblock,
#  endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger           = nrf91_spi_trigger,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = nrf91_spi1register,  /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct nrf91_spidev_s g_spi1dev =
{
  .spidev    =
  {
    .ops     = &g_spi1ops,
  },

  .base      = NRF91_SPIM1_BASE,
  .lock      = NXMUTEX_INITIALIZER,
#ifdef CONFIG_NRF91_SPI_MASTER_INTERRUPTS
  .sem_isr   = SEM_INITIALIZER(0),
  .irq       = NRF91_IRQ_SERIAL1,
#endif
  .sck_pin   = BOARD_SPI1_SCK_PIN,
  .frequency = 0,
  .mode      = 0
};
#endif

/* SPI2 */

#ifdef CONFIG_NRF91_SPI2_MASTER
static const struct spi_ops_s g_spi2ops =
{
  .lock              = nrf91_spi_lock,
  .select            = nrf91_spi2select,
  .setfrequency      = nrf91_spi_setfrequency,
  .setmode           = nrf91_spi_setmode,
  .setbits           = nrf91_spi_setbits,
#  ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = nrf91_spi_hwfeatures,
#  endif
  .status            = nrf91_spi2status,
#  ifdef CONFIG_SPI_CMDDATA
  .cmddata           = nrf91_spi2cmddata,
#  endif
  .send              = nrf91_spi_send,
#  ifdef CONFIG_SPI_EXCHANGE
  .exchange          = nrf91_spi_exchange,
#  else
  .sndblock          = nrf91_spi_sndblock,
  .recvblock         = nrf91_spi_recvblock,
#  endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger           = nrf91_spi_trigger,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = nrf91_spi2register,  /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct nrf91_spidev_s g_spi2dev =
{
  .spidev    =
  {
    .ops     = &g_spi2ops,
  },

  .base      = NRF91_SPIM2_BASE,
  .lock      = NXMUTEX_INITIALIZER,
#ifdef CONFIG_NRF91_SPI_MASTER_INTERRUPTS
  .sem_isr   = SEM_INITIALIZER(0),
  .irq       = NRF91_IRQ_SERIAL2,
#endif
  .sck_pin   = BOARD_SPI2_SCK_PIN,
  .frequency = 0,
  .mode      = 0
};
#endif

/* SPI3 */

#ifdef CONFIG_NRF91_SPI3_MASTER
static const struct spi_ops_s g_spi3ops =
{
  .lock              = nrf91_spi_lock,
  .select            = nrf91_spi3select,
  .setfrequency      = nrf91_spi_setfrequency,
  .setmode           = nrf91_spi_setmode,
  .setbits           = nrf91_spi_setbits,
#  ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = nrf91_spi_hwfeatures,
#  endif
  .status            = nrf91_spi3status,
#  ifdef CONFIG_SPI_CMDDATA
  .cmddata           = nrf91_spi3cmddata,
#  endif
  .send              = nrf91_spi_send,
#  ifdef CONFIG_SPI_EXCHANGE
  .exchange          = nrf91_spi_exchange,
#  else
  .sndblock          = nrf91_spi_sndblock,
  .recvblock         = nrf91_spi_recvblock,
#  endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger           = nrf91_spi_trigger,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = nrf91_spi3register,  /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct nrf91_spidev_s g_spi3dev =
{
  .spidev    =
  {
    .ops     = &g_spi3ops,
  },

  .base      = NRF91_SPIM3_BASE,
  .lock      = NXMUTEX_INITIALIZER,
#ifdef CONFIG_NRF91_SPI_MASTER_INTERRUPTS
  .sem_isr   = SEM_INITIALIZER(0),
  .irq       = NRF91_IRQ_SERIAL3,
#endif
  .sck_pin   = BOARD_SPI3_SCK_PIN,
  .frequency = 0,
  .mode      = 0
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf91_spi_putreg
 *
 * Description:
 *   Put a 32-bit register value by offset
 *
 ****************************************************************************/

static inline void nrf91_spi_putreg(struct nrf91_spidev_s *priv,
                                    uint32_t offset,
                                    uint32_t value)
{
  putreg32(value, priv->base + offset);
}

/****************************************************************************
 * Name: nrf91_spi_getreg
 *
 * Description:
 *   Get a 32-bit register value by offset
 *
 ****************************************************************************/

static inline uint32_t nrf91_spi_getreg(struct nrf91_spidev_s *priv,
                                        uint32_t offset)
{
  return getreg32(priv->base + offset);
}

/****************************************************************************
 * Name: nrf91_spi_isr
 *
 * Description:
 *   Common SPI interrupt service routine
 *
 ****************************************************************************/

#ifdef CONFIG_NRF91_SPI_MASTER_INTERRUPTS
static int nrf91_spi_isr(int irq, void *context, void *arg)
{
  struct nrf91_spidev_s *priv = (struct nrf91_spidev_s *)arg;

  /* Get interrupt event */

  if (nrf91_spi_getreg(priv, NRF91_SPIM_EVENTS_END_OFFSET) == 1)
    {
      /* Transfer is complete */

      nxsem_post(&priv->sem_isr);

      /* Clear event */

      nrf91_spi_putreg(priv, NRF91_SPIM_EVENTS_END_OFFSET, 0);
    }

  return OK;
}
#endif

/****************************************************************************
 * Name: nrf91_spi_init
 *
 * Description:
 *   Configure SPI
 *
 ****************************************************************************/

static int nrf91_spi_init(struct nrf91_spidev_s *priv)
{
  /* Disable SPI */

  nrf91_spi_putreg(priv, NRF91_SPIM_ENABLE_OFFSET, SPIM_ENABLE_DIS);

