apache/nuttx/arch/arm/src/nrf91/nrf91_spi.c
      if (txbuffer != NULL)
        {
          nrf91_spi_putreg(priv, NRF91_SPIM_TXDLIST_OFFSET, 1);
        }
    }

  while (nwords_left > 0)
    {
      size_t transfer_size = (nwords_left > 255 ? 255 : nwords_left);

      if (rxbuffer != NULL)
        {
          /* Write number of bytes in RXD buffer */

          nrf91_spi_putreg(priv, NRF91_SPIM_RXDMAXCNT_OFFSET, transfer_size);
        }

      if (txbuffer != NULL)
        {
          /* Write number of bytes in TXD buffer */

          nrf91_spi_putreg(priv, NRF91_SPIM_TXDMAXCNT_OFFSET, transfer_size);
        }

      /* SPI start */

      nrf91_spi_putreg(priv, NRF91_SPIM_TASK_START_OFFSET, SPIM_TASKS_START);

#ifndef CONFIG_NRF91_SPI_MASTER_INTERRUPTS
      /* Wait for RX done and TX done */

      while (nrf91_spi_getreg(priv, NRF91_SPIM_EVENTS_END_OFFSET) != 1);

      /* Clear event */

      nrf91_spi_putreg(priv, NRF91_SPIM_EVENTS_END_OFFSET, 0);
#else
      /* Wait for transfer complete */

      nxsem_wait_uninterruptible(&priv->sem_isr);
#endif

      regval = nrf91_spi_getreg(priv, NRF91_SPIM_TXDAMOUNT_OFFSET);
      if (regval != transfer_size)
        {
          spierr("Incomplete transfer wrote %" PRId32 " expected %zu\n",
                 regval, transfer_size);
        }

      /* SPI stop */

      nrf91_spi_putreg(priv, NRF91_SPIM_TASK_STOP_OFFSET, SPIM_TASKS_STOP);

      /* Wait for STOP event */

      while (nrf91_spi_getreg(priv, NRF91_SPIM_EVENTS_STOPPED_OFFSET) != 1);

      /* Clear event */

      nrf91_spi_putreg(priv, NRF91_SPIM_EVENTS_STOPPED_OFFSET, 0);

      nwords_left -= transfer_size;
    }

  /* Clear RX/TX DMA after transfer */

  nrf91_spi_putreg(priv, NRF91_SPIM_RXDPTR_OFFSET, 0);
  nrf91_spi_putreg(priv, NRF91_SPIM_RXDMAXCNT_OFFSET, 0);
  nrf91_spi_putreg(priv, NRF91_SPIM_TXDPTR_OFFSET, 0);
  nrf91_spi_putreg(priv, NRF91_SPIM_TXDMAXCNT_OFFSET, 0);

  /* Clear list mode */

  if (nwords > 0xff)
    {
      nrf91_spi_putreg(priv, NRF91_SPIM_RXDLIST_OFFSET, 0);
      nrf91_spi_putreg(priv, NRF91_SPIM_TXDLIST_OFFSET, 0);
    }
}

#ifndef CONFIG_SPI_EXCHANGE

/****************************************************************************
 * Name: nrf91_spi_sndblock
 *
 * Description:
 *   Send a block of data on SPI
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   nwords   - the length of data to send from the buffer in number of
 *              words.  The wordsize is determined by the number of
 *              bits-per-word selected for the SPI interface.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void nrf91_spi_sndblock(struct spi_dev_s *dev,
                               const void *txbuffer,
                               size_t nwords)
{
  spiinfo("txbuffer=%p nwords=%zu\n", txbuffer, nwords);
  return nrf91_spi_exchange(dev, txbuffer, NULL, nwords);
}

/****************************************************************************
 * Name: nrf91_spi_recvblock
 *
 * Description:
 *   Receive a block of data from SPI
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - the length of data that can be received in the buffer in
 *              number of words. The wordsize is determined by the number of
 *              bits-per-word selected for the SPI interface.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void nrf91_spi_recvblock(struct spi_dev_s *dev,
                                void *rxbuffer,
                                size_t nwords)
{
  spiinfo("txbuffer=%p nwords=%zu\n", rxbuffer, nwords);
  return nrf91_spi_exchange(dev, NULL, rxbuffer, nwords);
}
#endif /* CONFIG_SPI_EXCHANGE */

/****************************************************************************
 * Name: nrf91_spi_trigger
 *
 * Description:
 *   Trigger a previously configured DMA transfer.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *
 * Returned Value:
 *   OK       - Trigger was fired
 *   -ENOSYS  - Trigger not fired due to lack of DMA or low level support
 *   -EIO     - Trigger not fired because not previously primed
 *
 ****************************************************************************/

#ifdef CONFIG_SPI_TRIGGER
static int nrf91_spi_trigger(struct spi_dev_s *dev)
{
  return -ENOSYS;
}
#endif

#ifdef CONFIG_PM
/****************************************************************************
 * Name: nrf91_spi_pm_prepare
 ****************************************************************************/

static int nrf91_spi_pm_prepare(struct pm_callback_s *cb, int domain,
                                enum pm_state_e pmstate)
{
  if (pmstate == PM_STANDBY || pmstate == PM_SLEEP)
    {
      bool active = false;

#ifdef CONFIG_NRF91_SPI0_MASTER
      active |= nrf91_spi_getreg(&g_spi0dev, SPIM_EVENTS_STARTED);
#endif
#ifdef CONFIG_NRF91_SPI1_MASTER
      active |= nrf91_spi_getreg(&g_spi1dev, SPIM_EVENTS_STARTED);
#endif
#ifdef CONFIG_NRF91_SPI2_MASTER
      active |= nrf91_spi_getreg(&g_spi2dev, SPIM_EVENTS_STARTED);
#endif
#ifdef CONFIG_NRF91_SPI3_MASTER
      active |= nrf91_spi_getreg(&g_spi3dev, SPIM_EVENTS_STARTED);
#endif

      if (active)
        {
          /* SPI is being used, cannot disable */

          return -1;
        }
      else
        {
          /* SPI is inactive, can go to sleep */

          return 0;
        }
    }
  else
    {
      /* We can always go to any other state */

      return 0;
    }
}

/****************************************************************************
 * Name: nrf91_spi_pm_notify
 ****************************************************************************/

static void nrf91_spi_pm_notify(struct pm_callback_s *cb, int domain,
                                enum pm_state_e pmstate)
{
  if (pmstate == PM_SLEEP || pmstate == PM_STANDBY)
    {
      /* Deinit SPI peripheral on each initialized device */

#ifdef CONFIG_NRF91_SPI0_MASTER
      if (g_spi0dev.initialized)
        {
          nrf91_spi_deinit(&g_spi0dev);
        }
#endif

#ifdef CONFIG_NRF91_SPI1_MASTER
      if (g_spi1dev.initialized)
        {
          nrf91_spi_deinit(&g_spi1dev);
        }
#endif

#ifdef CONFIG_NRF91_SPI2_MASTER
      if (g_spi2dev.initialized)
        {
          nrf91_spi_deinit(&g_spi2dev);
        }
#endif

