apache/nuttx/arch/arm/src/nrf91/nrf91_spi.c
#ifdef CONFIG_NRF91_SPI3_MASTER
      if (g_spi3dev.initialized)
        {
          nrf91_spi_deinit(&g_spi3dev);
        }
#endif
    }
  else
    {
      /* Reinit SPI peripheral on each initialized device */

#ifdef CONFIG_NRF91_SPI0_MASTER
      if (g_spi0dev.initialized)
        {
          nrf91_spi_init(&g_spi0dev);
        }
#endif

#ifdef CONFIG_NRF91_SPI1_MASTER
      if (g_spi1dev.initialized)
        {
          nrf91_spi_init(&g_spi1dev);
        }
#endif

#ifdef CONFIG_NRF91_SPI2_MASTER
      if (g_spi2dev.initialized)
        {
          nrf91_spi_init(&g_spi2dev);
        }
#endif

#ifdef CONFIG_NRF91_SPI3_MASTER
      if (g_spi3dev.initialized)
        {
          nrf91_spi_init(&g_spi3dev);
        }
#endif
    }
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf91_spibus_initialize
 *
 * Description:
 *   Initialize the selected SPI port.
 *
 * Input Parameters:
 *   Port number (for hardware that has multiple SPI interfaces)
 *
 * Returned Value:
 *   Valid SPI device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct spi_dev_s *nrf91_spibus_initialize(int port)
{
  struct nrf91_spidev_s *priv = NULL;

  /* Get SPI driver data */

  switch (port)
    {
#ifdef CONFIG_NRF91_SPI0_MASTER
      case 0:
        {
          priv = &g_spi0dev;
          break;
        }
#endif

#ifdef CONFIG_NRF91_SPI1_MASTER
      case 1:
        {
          priv = &g_spi1dev;
          break;
        }
#endif

#ifdef CONFIG_NRF91_SPI2_MASTER
      case 2:
        {
          priv = &g_spi2dev;
          break;
        }
#endif

#ifdef CONFIG_NRF91_SPI3_MASTER
      case 3:
        {
          priv = &g_spi3dev;
          break;
        }
#endif

      default:
        {
          goto errout;
        }
    }

  /* Initialize the SPI */

  nrf91_spi_init(priv);

  /* Mark device as initialized */

  priv->initialized = true;

#ifdef CONFIG_NRF91_SPI_MASTER_INTERRUPTS
  /* Attach SPI interrupt */

  irq_attach(priv->irq, nrf91_spi_isr, priv);
  up_enable_irq(priv->irq);
#endif

errout:
  return (struct spi_dev_s *)priv;
}
